In [3]:
import pandas as pd
from pandas import DataFrame
df=pd.DataFrame({'col1':['A']*3+['B']*4+['C','B','A'],'col2':[2,3,4,2,4,2,1,3,4,4]})
df

  col1  col2
0    A     2
1    A     3
2    A     4
3    B     2
4    B     4
5    B     2
6    B     1
7    C     3
8    B     4
9    A     4

In [18]:
df.drop_duplicates()#Drops the duplicates

  col1  col2
0    A     2
1    A     3
2    A     4
3    B     2
4    B     4
6    B     1
7    C     3

In [21]:
df.drop_duplicates(subset='col1',keep='first')#in oer to keep only first occurance use subset and keep first. if keep last then last values will come.

  col1  col2
0    A     2
3    B     2
7    C     3

In [23]:
#Q2-Create new df from this, Replace missing value by 99.
df=pd.DataFrame([[1,2,3,np.nan,4],
                [2,np.nan,5,6,4],
                [np.nan,7,np.nan,9,6],
                [1,np.nan,np.nan,6,7]])
df

     0    1    2    3  4
0  1.0  2.0  3.0  NaN  4
1  2.0  NaN  5.0  6.0  4
2  NaN  7.0  NaN  9.0  6
3  1.0  NaN  NaN  6.0  7

In [24]:
df.fillna(99,axis=1)

      0     1     2     3  4
0   1.0   2.0   3.0  99.0  4
1   2.0  99.0   5.0   6.0  4
2  99.0   7.0  99.0   9.0  6
3   1.0  99.0  99.0   6.0  7

In [34]:
#Q3
a=np.array((1,2,3,2,3,4,3,4,5,6))
b=np.array((7,2,10,2,7,4,9,4,9,8))
a=set(a)
b=set(b)
list(a.intersection(b))

[2, 4]

In [73]:
#Q4
a=list(np.array((1,2,3,4,5)))
b=list(np.array((1,2,3,6,7)))
c=[]
for i in a:
    if i in b:
        c.append(i) #Only strings can be concatenated. list tuple can be appended.
print(np.array(c))

[1 2 3]

In [77]:
#Q4
a=np.array((1,2,3,4,5))
b=np.array((1,2,3,6,7))
c=[]
for i in a:
    if i in b:
        c=c+i #Only strings can be concatenated. array list tuple can be appended.
print(np.array(c))

[]